recipe_backend/app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients"
---
    def index
        ingredients = Ingredient.all

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        ingredient = Ingredient.find(params[:id])

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def create
        #binding.pry
         recipe = Recipe.find(params[:recipe_id])