recipe_backend/app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
    def index
        recipes = Recipe.all

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        recipe = Recipe.find(params[:id])

INSERT INTO "recipes" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "candy"], ["created_at", "2020-04-27 00:08:22.822438"], ["updated_at", "2020-04-27 00:08:22.822438"]]
---
    def create
       #binding.pry
        recipe = Recipe.create(title: params[:title])